app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" DEFAULT VALUES
---
  def create
    @class = SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def show
    @class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def edit
    @class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @class = SchoolClass.find_by(params[:id])
    @class.update(school_class_params)