app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-02-06 01:02:35.312822"], ["updated_at", "2018-02-06 01:02:35.312822"]]
---
  def create
    @student = Student.new(student_params)
    @student.save

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
---
  def show
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
---
  def edit
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-02-06 01:11:28.128964"], ["id", 1]]
---
  def update
    @student = Student.find_by(params[:id])
    @student.update(student_params)